[
  {
    "title": "Digital Imaging and Color Management Fundamentals (seminar)",
    "description": "This one-day seminar is an excellent introduction to Photoshop or any image-editing software. It lays down the foundation for understanding bitmap editing and digital photography.\n\n## What will be covered\n\n- Definition of Digital Imaging\n- Tools in Digital Imaging\n- Building a Photoshop System\n- Computer Graphics\n- Scanning Techniques\n- Color Basics and Color Management\n- Digital Workflow\n\n## Who should attend\n\nRecommended participants include graphic designers, illustrators, photographers, art directors, corporate communicators, and advertising executives who want to understand the digital imaging process. This is a must for those who want to take up [Adobe Photoshop Essentials](#) but is also recommended to the self-taught Photoshop users.\n\n",
    "instructors": [],
    "fee": 2950,
    "category": {
      "name": "Photography"
    }
  },
  {
    "title": "Adobe Photoshop CC Essentials",
    "description": "Learning by yourself often results in using the same 20% of Photoshop again and again. You also apply correction filters and adjustments without understanding the various options.\n\nThis focused, hands-on workshop guides you through the Photoshop fundamentals that will equip you to execute design projects. Included are lessons on layers (putting photos together), selecting and extracting parts of a photo, retouching, changing an object's color while retaining its texture, correcting off-color photos, removing defects, adding and manipulating text, and more.\n\nProjects you can apply the techniques to range from print ads, marketing collaterals, Websites, and other communication materials.\n\n##### Expected Outcome\n\nAt the end of the course, participants are expected to:\n\n*   Be able to set up Photoshop\n*   Use tools and adjust their settings\n*   Recognize and use essential panels\n*   Create precise selections\n*   Fix common photo problems (correct color cast, recover tones, etc.)\n*   Create and use layers to organize art work\n*   Add and edit text on images\n*   Be able to apply Photoshop on images intended for print, presentation and online\n\n##### Who will benefit\n\nIf you are a photographer, graphic designer, web designer, or painter with little or no background in computer imaging, and now want to expand your business or your craft, this course is for you!\n\n##### Course Outline\n\n*   Preparing the work area\n    *   setting the preferences\n    *   choosing the appropriate color space\n    *   creating your own work space\n*   Setting Bridge to organize your images\n*   How to use Bridge to bring images into Photoshop\n*   Navigating in Photoshop\n*   Cropping and aligning images if necessary\n*   Performing global adjustments to images\n    *   cleaning\n    *   color correction\n    *   color enhancement\n    *   exposure adjustment\n    *   tonal adjustment\n*   Performing local adjustments to an image\n    *   how to use the selection tools and techniques\n    *   how to save selections as channel mask\n    *   how to convert selections into layers\n    *   how to use Blending properties of layers\n    *   how to use the adjustment layers\n    *   how to use the layer mask\n*   Sharpening the final image\n*   Preparing the file for outputting\n*   Bonus: applying special effects to an image\n\n##### Prerequisite\n\nParticipants should have completed PCCI’s [Digital Imaging and Color Management Fundamentals](DigitalImaging-Fundamentals.html) seminar or have equivalent experience.\n\n",
    "instructors": [],
    "fee": 6950,
    "category": {
      "name": "Image Editing"
    }
  },
  {
    "title": "Seminar: Web Design Fundamentals",
    "description": "A one-day seminar that introduces participants to technical considerations that impact on Web design. Issues covered include cross-platform and cross-browser designing; the nature of WWW imaging; navigation and usability; and interactivity. Prerequisite for Web design courses.\n\n##### **What will be covered**\n\n*   How the WWW fits into the Internet\n*   Components of a Web page and how they work\n*   Layers of Web design\n*   The basic elements of a Web page\n*   Languages of the Web\n*   Multimedia\n*   Print imaging vs. Web imaging\n*   HTML or Flash?\n*   Essential tools for Web designers and developers\n*   Web design and development process\n*   Basic design principles\n*   Implications of user control on Web design\n*   Factors affecting download speed\n*   Usability and navigation\n*   How to conceptualize a usable, interactive Web site\n\n##### **Who should attend**\n\nAll those planning to go into designing and building Web sites, either for hobby or for work. Web designers who want to further improve their Web pages or are still confused about the intricacies of the cyber media can benefit from this seminar as well.\n",
    "instructors": [],
    "fee": 2950,
    "category": {
      "name": "Web Design & Development"
    }
  },
  {
    "title": "E-Learning Basics with Adobe Captivate",
    "description": "Adobe Captivate allows you to create interactive eLearning content and provide custom online training to employees or clients. This is a two day intensive hands-on workshop with the industry standard on in authoring interactive eLearning content.\n\n##### What will be covered\n\n*   Learn to make a presentation from scratch or with built-in themes, import images and PowerPoint slides, and add interest with animation, widgets, and video.\n*   Plus, add built-in smart learning interactions to your projects, which add more complex interactivity.\n*   You’ll also discover how to prepare for and record a software simulation, synchronize video, add audio, and build quizzes into your project.\n\n##### Who should attend\n\n*   Anyone who what to create software demonstrations or interactive simulations\n*   Brand professionals\n*   Sales and marketing professionals\n*   eLearning Developers and Designers\n*   Educators\n*   Trainers\n*   Instructional Designers\n*   Sales and Marketing Professionals\n\n##### Prerequisites\n\nKnowledge in basic computer operation is a must.\n",
    "instructors": [],
    "fee": 7250,
    "category": {
      "name": "E-Learning"
    }
  },
  {
    "title": "Script Writing & Development for Film",
    "description": "Screenwriting is a distinctive approach to storytelling for the visual medium. This 5-session workshop is an introduction to the basic principles of dramatic writing that guides the student to the creative and technical process of translating a concept to a screenplay.\n\n##### What will be covered\n\n*   Screenwriting concepts and terms\n*   Structure and plot\n*   Character and archetypes\n*   Format and style\n*   Pitching and concept development\n*   The 3-act paradigm\n*   Dialogue\n*   Dramatic beats\n*   Alternative structures and nonlinear plots\n*   Dramatic and narrative voice\n*   Screenwriting software\n\n**Recommended Reading:** _\"Trip to Quiapo\" by Ricky Lee._\n\n##### Who should attend\n\nIf you have an interest in filmmaking, some writing experience, and a college level education, this workshop is for you.\n\n##### Schedule\n\nPlease note, this hands-on workshop is scheduled differently from most other PCCI classes. Instead, of an _all-day, consecutive-day_ schedule, this class will be spread out over 5 sessions.\n\nIn addition, there will be an online consultation between each class day, so the instructor can discuss the participants’ writing progress.\n\n##### About the instructor\n\nKhalil Joseph Bañares is a filmmaker from Manila, Philippines. His films have competed in various film festivals abroad. His films range from historical documentaries, advocacy films, erotic thrillers and romantic flicks. He has worked in different industries such as advertising, TV, digital and films. Aside from filmmaking, he is a marketing professional. With projects ranging from digital marketing, OOH, OTT and content creation.\n",
    "instructors": [],
    "fee": 7500,
    "category": {
      "name": "Photography"
    }
  },
  {
    "title": "Basic Video & Film Production",
    "description": "Making videos is becoming a trend nowadays especially with the accessible internet access. Whether you're a YouTuber, blogger, vlogger, business owner, aspiring filmmaker, or just someone who wants to create videos as a hobby, this is a great introductory workshop for you to learn how to make professional videos with this course.\n\nThis workshop will cover the three basic stages of film and video production and provide insights on producing film and video projects which starts with building the storyline to shooting the scenes. There are hands on activities throughout the workshop and participants will be grouped for the final project.\n\n**By the end of the course, you will:**\n\n*   Understand the difference between Film Making and Video Production\n*   Learn the stages of film making and video production for planning and execution\n*   Learn the basic equipment and gears\n*   Apply the camera composition, angles and movement\n*   Create a final project by building a storyline and shooting then editing the scenes to complimenting the story\n\n**Note:** Different film clips will be shown and analyzed during the 2-day workshop. The instructor will also share valuable insider information and personal experience on the Philippine film industry. He may adjust certain topics depending on the students’ needs.\n\n##### Topics\n\nDay 1:\n\n*   (A) Pre-Production\n    *   (1) Idea to Image : The goal of film production\n    *   (2) Story: The most important element in film production\n    *   (3) Script and Storyboard\n    *   (4) Crew\n    *   (5) The Actor\n*   (B) Production\n    *   (1) Camera\n        *   (a) Tools  \n            (a.1) Camera (Video Camera vs. DSLR)  \n            (a.2) Lens  \n            (a.3) Mounting  \n            \n        *   (b) Composition  \n            (b.1) Shot (Rule of Thirds and 180-Degree Rule)  \n            (b.2) Framing  \n            (b.3) Angles  \n            \n        *   (c) Movement\n    *   (2) Lighting\n        *   (a) Source\n        *   (b) Basic Set-Up\n    *   (3) Sound\n        *   (a) Equipment\n        *   (b) Recording\n\nDay 2:\n\n*   (C) Post-Production\n    *   (1) Editing\n    *   (2) Effects\n\n##### Activities\n\nDay 1:\n\n*   Short film analysis.\n*   Storytelling exercise.\n*   Individual take home assignment on camera composition and movement.\n\nDay 2:\n\n*   Short flm output (group activity) to be written, shot, edited, and viewed in class. Based on the principle of the 3-Act Structure and Dramatic Arc. **Note:** topic(s) will be given during the workshop.\n\n##### What to bring\n\nParticipants who have their own digital camcorders or DSLR camera are encouraged to bring them to class.\n\n##### Who Should Attend\n\nThis workshop is open to high school students up to working professionals who may or may not have prior background in video or film production but are willing to learn the basics of the trade as a skill or a business or a hobby.\n",
    "instructors": [],
    "fee": 6950,
    "category": {
      "name": "Film & Video"
    }
  },
  {
    "title": "Dynamic Acrylic Painting",
    "description": "Try your hand at painting! Transfer your imagination to canvas! Don't worry if you can't draw very well, painting is as much imagination as drawing skill. You don't even need to color inside the lines, because there are no lines.\n\nBy the end of the workshop, you will learn the basic techniques in creating _Still Life and Blending Colors Painting_ using the acrylic medium and canvass. A great activity that you can enjoy with your friends and family!\n\n##### What will be covered\n\n*   Project 1: Blending colors painting\n\nThis project involves painting with blending colors. It's a great way to create a gradual transition from one color to another and is very useful in creating the finer details and making your paintings look more realistic.\n\n*   Project 2: Still Life Alla Prima\n\nParticipants paint a still life subject in the impressionist style, using brush and palette knife.\n\n##### Who should attend\n\nOpen to 8 years old and up, interested in learning acrylic painting, or starting out in art. A great activity that you can enjoy with your friends and family!\n\n##### Workshop Fee Inclusions\n\nAt the end of the workshop, each participant can bring home all their finished paintings.\n\nAll supplies will be provided (desktop easels, canvas board, paints, paint brush, paint palette, palette knife, apron...etc).\n\n**All you need to bring is lot of enthusiasm and willingness to learn.**\n\n##### About the instructor\n\nRonna Lara-Bes is a practicing artist, whose multi-disciplinary specialties are: painting (oil, acrylic, and watercolor), sculptures (clay, resin, 3D printing, assemblage) and photography. She has successfully launched two solo exhibitions in Manila, and her works have also been exhibited in Vienna, Rome, and Leeds (UK). Ronna is a member of the faculty of Feati University’s School of Fine Arts.\n\n*   2nd Place Winner: Manila Bulletin Sketchfest 2016, Exhibition Category\n*   Grand Winner: Metrobank's MADE Awards 2018, Sculpture Category\n\n**More samples: acrylic on canvas painting** ![Photoshop for Kids](../../images/dynamic-painting-samples.jpg)\n",
    "instructors": [],
    "fee": 2950,
    "category": {
      "name": "Special & Seasonal Courses"
    }
  }
]
